Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་ལ་སེམས་ཤིང་བསམས་ནས། རྗེས་སུ་ཡི་རང་བའི་རབ་དམ་པ། མཆོག་ཕུལ་གཙོ་བོ་གྱ་ནོམ་པ། བླ་ན་མེད་པ། གོང་ན་མེད་པ། མཉམ་པ་མེད་པ། མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་བ་ཡིན། སེམས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་བ་ཡིན། ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་བ་ཡིན། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Then the great bodhisattva Maitreya asked the venerable Subhūti, “If bodhisattva great beings who have newly entered into the vehicle bring to mind all those roots of virtuous action of the lord buddhas and the saṅghas of the śrāvakas of the lord buddhas, and having reflected upon these, rejoice in them with the best, most authentic, supreme, perfect, foremost, most sublime, unsurpassed, and highest rejoicing that is unequaled and equal to the unequaled, and dedicate them to unsurpassed, complete enlightenment, how will those bodhisattva great beings not have a mistaken idea, how will they not have mistaken thoughts, and how will they not have mistaken views?” “

source: བྱམས་པ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་བཅས་པ་དེ་དག་ལ་སེམས་ཀྱང་། དེ་ལ་སངས་རྒྱས་སུ་འདུ་ཤེས་པར་མི་འགྱུར། ཉན་ཐོས་སུ་འདུ་ཤེས་པར་མི་འགྱུར། དགེ་བའི་རྩ་བར་འདུ་ཤེས་པར་མི་འགྱུར་ཞིང་།
en: Maitreya,” replied Subhūti, “even though those bodhisattva great beings bring to mind the lord buddhas along with their śrāvakas, they will not perceive the buddhas, they will not perceive the śrāvakas, they will not perceive the roots of virtuous action, and they will not perceive the mind even in those thoughts through which the dedication is made.

source: སེམས་གང་གིས་ཡོངས་སུ་བསྔོ་བའི་སེམས་དེ་ལ་ཡང་སེམས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་ན། དེ་ལྟར་ཡོངས་སུ་བསྔོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་བ་མེད་དོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་བ་མེད་དོ། །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་བ་མེད་དོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ།
en: If this is the case, bodhisattva great beings who make the dedication in that manner will be without mistaken ideas, they will be without mistaken thoughts, and they will be without mistaken views.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་བཅས་པ་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་ལ་སེམས་ཤིང་། མཚན་མར་འཛིན་ལ་མཚན་མར་བཟུང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ན། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ།
en: If, on the other hand, those bodhisattva great beings were to bring to mind those lord buddhas, along with their śrāvakas and those roots of virtuous action, holding them as a distinguishing mark, and after holding them as a distinguishing mark were then to dedicate them to unsurpassed, complete enlightenment, that would constitute a mistaken idea, a mistaken thought, and a mistaken view on the part of bodhisattva great beings. “

source: །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་གང་གིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་བཅས་པ་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་ལ་སེམས་པའི་སེམས་དེ་ལ་ཡང་དག་པར་སེམས་ཤིང་། འདི་ལྟར་ཟད་པ་ལ་ཟད་ཅེས་བྱ་བར་ཤེས་ལ་གང་ཟད་པ་དེས་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་ཏེ།
en: If those bodhisattva great beings genuinely reflect on the mind by which they think of those lord buddhas, along with their śrāvakas, and know that that which is extinct is extinct, they cannot make their dedication by means of that which is extinct. {

source: སེམས་གང་གིས་ཡོངས་སུ་བསྔོ་བའི་སེམས་དེ་ཉིད་ཀྱི་ཆོས་ཉིད་ཀྱང་དེ་ཡིན་ལ།
en: Ki.II-III: 129} Rather, it is said that it is the very reality of the mind by which the dedication is made and it is the very reality of phenomena to which the dedication is made.

source: ཆོས་གང་ལ་ཡོངས་སུ་བསྔོ་བའི་ཆོས་དེའི་ཆོས་ཉིད་ཀྱང་དེ་ཡིན་ནོ་ཞེས། གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་ན།
en: If they make the dedication in that manner, they will make an authentic dedication.

source: ཡང་དག་པར་ཡོངས་སུ་བསྔོ་བ་སྟེ་ལོག་པ་མ་ཡིན་ནོ།
en: It will not be erroneous.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དེ་དག་གི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དང་། དེ་དག་ཏུ་སོ་སོའི་སྐྱེ་བོ་མང་པོས་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་བསྐྱེད་པ་དང་། ཆོས་བསྟན་པ་གང་ཇི་སྙེད་ཅིག་ཐོས་པ་དང་། དེ་དག་ཏུ་ལྷ་དང་། ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་བསྐྱེད་པ་དང་། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་སམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་སམ།
en: So that is the manner in which bodhisattva great beings should dedicate the roots of virtuous action. “

source: ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་སམ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སམ། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་བསྐྱེད་པ་དང་། དམ་པའི་ཆོས་ཇི་སྙེད་ཅིག་ཐོས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་མངོན་པར་བསྡུས་ཏེ། གཅིག་ཏུ་བརྟུལ་ནས་ཚད་བཟུང་སྟེ། རྗེས་སུ་ཡི་རང་བའི་རབ། མཆོག་ཕུལ། དམ་པ། གྱ་ནོམ་པ། བླ་ན་མེད་པ། གོང་ན་མེད་པ། མཉམ་པ་མེད་པ། མི་མཉམ་པ་དང་། མཉམ་པས་རྗེས་སུ་ཡི་རང་ནས། དེ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་། གལ་ཏེ་འདི་ལྟར་ཆོས་དེ་དག་ནི་ཟད་དོ། །འགགས་སོ། མེད་དོ། རྣམ་པར་གྱུར་ཏོ། །གང་ལ་ཡོངས་སུ་བསྔོ་བའི་སེམས་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པའོ་ཞེས།
en: If bodhisattva great beings were to gather together, assimilate, and evaluate all the roots of virtuous action of the lord buddhas of the past, future, and present, commencing from the time when they first begin to set their mind on enlightenment for as long as their Dharma remains; as well as all the roots of virtuous action of the śrāvakas and pratyekabuddhas, and among them all the roots of virtuous action generated by many ordinary persons, along with all the teachings of the Dharma that they have heard; and also among them, all the roots of virtuous action generated by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas; and all the roots of virtuous action generated by members of great and lofty royal families, by members of great and lofty priestly families, and by members of great and lofty householder families; and by the gods of Caturmahā­rāja­kāyika, and the gods [of other realms], up to and including Akaniṣṭha, along with all the Dharmas that they have heard, and all the settings of the mind on unsurpassed, complete enlightenment that they have accrued, and then were to rejoice in them with the best, most authentic, supreme, perfect, foremost, most sublime, unsurpassed, and highest rejoicing that is unequaled and equal to the unequaled, and dedicate all these to unsurpassed, complete enlightenment—and if they were to make this dedication, [knowing] that those attributes are extinct, defunct, nonexistent, and reversed, and that even the thought of those to whom the dedication is made is empty of inherent existence—then they will have dedicated these to unsurpassed, complete enlightenment. “

source: གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་ཡིན་ནོ། །གལ་ཏེ་འདི་ལྟར་ཆོས་ཀྱིས་ཆོས་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་སྟེ།
en: Phenomena will not dedicate phenomena.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཤེས་ལ།
en: If you ask why, it is because all phenomena are empty of inherent existence.

source: གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་དེ་དག་ནི་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: If they know this, and if they make their dedication accordingly, they will have made their dedication to unsurpassed, complete enlightenment.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ།
en: So it is that when bodhisattva great beings practice the perfection of wisdom, and practice the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, they will not have mistaken ideas, they will not have mistaken thoughts, and they will not have mistaken views.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡོངས་སུ་བསྔོ་བ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: If you ask why, it is because these bodhisattva great beings are not attached to their dedication.

source: །དགེ་བའི་རྩ་བ་དེ་དག་ལ་ཡང་མངོན་པར་ཆགས་པ་མེད་དོ། །བྱང་ཆུབ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They are not attached to those roots of virtuous action, and they do not observe even enlightenment.

source: །གང་ལ་ཆགས་པར་འགྱུར་བའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Nor do they even observe the mind of enlightenment to which they could be attached.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་བསྔོ་བ་བླ་ན་མེད་པའོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསོད་ནམས་བྱ་བའི་དངོས་པོ་མངོན་པར་འདུ་བྱ་བ་དེ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་དབེན་པར་ཤེས་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་དབེན་པར་ཤེས།
en: This is the unsurpassed dedication of bodhisattva great beings. “

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་དབེན་པར་ཤེས། ནང་སྟོང་པ་ཉིད་ཀྱིས་དབེན་པར་ཤེས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱིས་དབེན་པར་ཤེས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱིས་དབེན་པར་ཤེས། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་དབེན་པར་ཤེས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: If bodhisattva great beings know that their accumulation of the foundation of meritorious action is devoid of the aggregates, sensory elements, and sense fields; if they know that it is devoid of the perfection of wisdom; if they know that it is devoid of the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, {Ki.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱིས་དབེན་པར་ཤེས་ན། རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། བསོད་ནམས་བྱ་བའི་དངོས་པོ་མངོན་པར་འདུ་བྱ་བ་རེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་ཡིན་ནོ། །གལ་ཏེ་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་མངོན་པར་འདུ་བྱ་བ་དེ། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་མངོན་པར་འདུ་བྱ་བ་དེ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པར་ཤེས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །དགེ་བའི་རྩ་བ་དེ་དག་ནི་དགེ་བའི་རྩ་བའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །མངོན་པར་འདུ་བྱ་བ་དེ་དག་ནི་མངོན་པར་འདུ་བྱ་བའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། བྱང་ཆུབ་ཀྱི་སེམས་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །ཡོངས་སུ་བསྔོ་བ་ནི་ཡོངས་སུ་བསྔོ་བའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། བྱང་ཆུབ་ནི་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ།
en: II-III: 130} and the perfection of generosity; if they know that it is devoid of the emptiness of internal phenomena; if they know that it is devoid of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; if they know that it is devoid of the thirty-seven factors conducive to enlightenment; and if they know that it is devoid of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, then, Subhūti, bodhisattva great beings will gather the foundation of meritorious action and dedicate it to unsurpassed, complete enlightenment. “

source: །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །ཕྱི་སྟོང་པ་ཉིད་ནི་ཕྱི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །ཕྱི་ནང་སྟོང་པ་ཉིད་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ནོ་ཞེས་བྱ་བར་ཤེས་ན།
en: If bodhisattva great beings know that that foundation of meritorious action, endowed with rejoicing, is devoid of the essential nature of this accumulation, and if they know that the lord buddhas are devoid of the essential nature of the buddhas; that the roots of virtuous action are devoid of the essential nature of the roots of virtuous action; that those accumulations are devoid of the essential nature of the accumulations; that the mind of enlightenment is devoid of the essential nature of the mind of enlightenment; that dedication is devoid of the essential nature of dedication; that enlightenment is devoid of the essential nature of enlightenment; that the perfection of wisdom is devoid of the essential nature of the perfection of wisdom; that the perfection of meditative concentration is devoid of the essential nature of the perfection of meditative concentration; that the perfection of perseverance is devoid of the essential nature of the perfection of perseverance; that the perfection of tolerance is devoid of the essential nature of the perfection of tolerance; that the perfection of ethical discipline is devoid of the essential nature of the perfection of ethical discipline; that the perfection of generosity is devoid of the essential nature of the perfection of generosity; that the emptiness of internal phenomena is devoid of the essential nature of the emptiness of internal phenomena; that the emptiness of external phenomena is devoid of the essential nature of the emptiness of external phenomena; that the emptiness of external and internal phenomena is devoid of the essential nature of the emptiness of external and internal phenomena; that the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are devoid of the essential nature of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; that the thirty-seven factors conducive to enlightenment are devoid of the essential nature of the thirty-seven factors conducive to enlightenment; that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways enlightenment are devoid of the essential nature of the dhāraṇī gateways [and so forth]; and that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are devoid of the essential nature of the eighteen distinct qualities of the buddhas [and so forth], then those bodhisattva great beings will accordingly practice the perfection of wisdom that is void.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་དབེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱད་པར་བྱ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This is perfection of wisdom that bodhisattva great beings have. “

source: །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་བསྔོ་ན། འདི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཇི་ལྟར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་བཞིན་དུ། དགེ་བའི་རྩ་བ་འདི་དག་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྟེ།
en: Moreover, if bodhisattva great beings dedicate the roots of virtuous action of those lord buddhas and their saṅghas of śrāvakas who have passed into final nirvāṇa, they should make the dedication in the following manner: Just as those lord buddhas have passed into final nirvāṇa, these roots of virtuous action, too, have passed into final nirvāṇa.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བསྔོ་བ་འདི་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ།
en: This dedication of those roots of virtuous action, which has been definitively made, has also passed into final nirvāṇa.

source: །སེམས་གང་གིས་བསྔོ་བའི་སེམས་དེ་ཡང་དེ་དང་ཚུལ་མཐུན་ཏེ།
en: The mind by which the dedication is made is also similar.

source: དེའི་ངོ་བོ་ཉིད་དོ་ཞེས། གལ་ཏེ་དེ་ལྟར་ཤེས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་ཡིན་ཏེ།
en: If one knows this to be their essential nature, then they will dedicate these to unsurpassed, complete enlightenment.

source: དེ་ལྟར་ཡོངས་སུ་བསྔོ་ན། འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ།
en: If they make the dedication in that manner, they will have no mistaken ideas, they will have no mistaken thoughts, and they will have no mistaken views. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཚན་མའི་ཚུལ་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་ཤེས་ན།
en: When bodhisattva great beings practice the perfection of wisdom, if they cognize those roots of virtuous action of the lord buddhas by way of a distinguishing mark, {Ki.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་མ་ཡིན་ནོ།
en: II-III: 131} then they will not dedicate them to unsurpassed, complete enlightenment.

source: །འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་པ་དེ་དག་ཀྱང་མཚན་མ་མ་ཡིན། མཚན་མའི་ཡུལ་མ་ཡིན་ནོ། །དེས་གལ་ཏེ་དེ་ལྟར་སེམས་ན་ཡང་མཚན་མར་བྱེད་པ་ཡིན་གྱིས། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་མ་ཡིན་ཏེ།
en: If, even though they think that all the lord buddhas of the past, as many as there are, are without distinguishing marks and without the objects of a distinguishing mark, they still engage in distinguishing marks, they would not dedicate those roots of virtuous action to unsurpassed, complete enlightenment.

source: དེ་ལྟར་ན་དེའི་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ། །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་འགྱུར་རོ།
en: In that way they would have mistaken ideas, they would have mistaken thoughts, and they would have mistaken views. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་མངོན་པར་འདུ་བྱ་བ་དེ་དག་དང་། སེམས་བསྐྱེད་པ་དེ་དག་ཡོངས་སུ་ཤེས་པ་མེད་ཅིང་མཚན་མར་མི་བྱེད་ན། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་ཡིན་ཏེ།
en: If bodhisattva great beings do not cognize those lord buddhas, those roots of virtuous action and their accumulations, and those settings of the mind on enlightenment, and if they do not form a distinguishing mark of them, then they will dedicate those roots of virtuous action to unsurpassed, complete enlightenment.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །སེམས་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ། །ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་མི་འགྱུར་རོ།
en: In that way they will have no mistaken ideas, they will have no mistaken thoughts, and they will have no mistaken views.”

source: །བྱམས་པས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་དེ་དག་ལ་མཚན་མར་མི་བྱེད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་ཡིན།
en: Maitreya then asked, “Blessed Subhūti, how do bodhisattva great beings not form a distinguishing mark of those roots of virtuous action, and then dedicate them to unsurpassed, complete enlightenment?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་ཐབས་མཁས་པ་དེ་དག་བསླབ་པར་བྱ་སྟེ།
en: Bodhisattva great beings should train in skillful means with regard to this perfection of wisdom,” replied Subhūti. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པ་རིག་པར་བྱའོ།
en: They should know the skillful means of bodhisattva great beings that originate from the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མ་རྟེན་པར་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །བྱམས་པས་སྨྲས་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མེད་དེ་མི་དམིགས་སོ་ཞེས་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། མངོན་པར་འདུ་བྱ་བ་དེ་དག་དང་།
en: Without relying on the perfection of wisdom, they cannot dedicate the foundation of meritorious action.”

source: གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སེམས་བསྐྱེད་པ་དེ་དག་ཀྱང་མེད་དེ་མི་དམིགས་སོ་ཞེས་བྱ་བ་འདི་སྐྱོན་དུ་སྨོས་པར་མི་འགྱུར་རམ་སྙམ་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། བདག་གི་ལུས་དེ་དག་ཀྱང་འགགས་པར་གྱུར། དགེ་བའི་རྩ་བ་དེ་དག་དང་།
en: Maitreya then said, “If one were to wonder whether there is a fault in this assertion that those lord buddhas do not even exist and are not apprehended in the perfection of wisdom, or that those roots of virtuous action, those accumulations, and those settings of the mind by which the dedication is made to unsurpassed, complete enlightenment do not even exist and are not apprehended, it is the case that when bodhisattva great beings practice the perfection of wisdom they should think as follows: ‘If even this body of mine has ceased, and if even those roots of virtuous action, those accumulations, and those settings of the mind on enlightenment have ceased, how could I conceive of those lord buddhas, those roots of virtuous action, those accumulations, and those settings of the mind on enlightenment by forming a distinguishing mark of them?’ “
